{"chapters": [{"summary": "Episode six of two parts two of Curious Buddy is aired today. The topic for today's episode is India Quizzes, a quiz show on random Chicken Boom Channel. It airs every Sunday at 11:30 m on the channel and is pretty regular.", "headline": "The topic for today's episode of Curious Buddy is India quizzes, a quiz show on random chicken boom channel.", "gist": "Intro and welcome.", "start": 30590, "end": 111746}, {"summary": "Today's topic is Indus Valley civilization. The first city discovered by excavation or by taking up was Harappa. Harappa was rediscovered in the 1920s and then expiration started in the 1930s. People got busy with their lives and forgot about an entire civilization.", "headline": "The first city discovered by excavation or by taking up was harappa.", "gist": "Indus valley civilization.", "start": 111928, "end": 420846}, {"summary": "The Indus Valley civilization was the largest in terms of India, and spread over modern day India, Pakistan, Afghanistan and Gagra Hakra Valley. There are more than 1000 cities that have been found till date, and almost 100 have been excavated. Most of the cities found are along the banks of Gazara HAKARA River, which is the old Sarasati River. The civilization had a population of 5 million people, and most of them lived in villages. Archaeologists have never been able to figure out the rural life of the civilization.", "headline": "The Indus Valley civilization was the largest in terms of population and spread over modern day India, Pakistan, Afghanistan and Gagra hakra Valley.", "gist": "The indus valley civilization.", "start": 421038, "end": 715980}, {"summary": "Bricks from India Valley civilization were used to construct a railway track from Lahore to Karachi in Pakistan there is a festival in festival and they did some sort of construction activity around the festival site. There was a lot of outrage but the festival went on as planned.", "headline": "Bricks from India Valley civilization were used to construct a railway track from Lahore to Karachi.", "gist": "Bricks from india valley civilization.", "start": 716550, "end": 817338}, {"summary": "There are some interesting facts about ancient Egyptian and Indian civilization. Ancient Egyptians had an insane level of planning. Every town was properly planned. They had a rectangular grid path. All the main streets followed north to south, and all the secondary streets followed east to west. There were no random roads coming from here and there. Most roads were around 10 meters wide. Indian cities are not known for spacious roads.", "headline": "There are some interesting facts about ancient Egyptian and Indian civilizations.", "gist": "India's well - planned civilization.", "start": 817484, "end": 1154182}, {"summary": "In ancient times, the water management system in India was very developed. Every house had a proper drainage system. They used flush in toilets, flush toilets, a system to remove wastewater from the house and bathrooms attached to rooms. They also knew about water conservation and rain harvesting. In Lothal in Monrodado and Raki, Gadi. There are evidence of aquaculture and water transport. There is no actual proof that Mohindud was this text or any reference to this. Most of these stories are legends and myths. The podcast is more to satisfy curiosities and to start a discussion that you guys can also participate in and learn together. Both before and me haven't studied history after school.", "headline": "They used flush in toilets. Flush toilets? A system to remove wastewater from the house and bathrooms attached to rooms.", "gist": "The crazy drainage system.", "start": 1154256, "end": 1693330}, {"summary": "There are many theories about the disappearance of civilization. One theory is that there was a shift in temperature and weather patterns over India around 2500 BC. Environment and climate were bigger reasons for the demise of civilization than an invasion from the north in the valley. Civilization was unique because of its planning and drainage system.", "headline": "There are many theories about the disappearance of civilization in India around 2500 BC.", "gist": "The disappearance of civilization.", "start": 1695330, "end": 1947998}, {"summary": "Indus Valley. Civilization was very peaceful. They didn't have any monarchy. They did not build any massive monuments. They spent most of their time and resources on the common people. They supported living people more than they spent money on dead people. Pachipati Seal suggests they worshiped DTS. There are two aspects to life. One is practical and the other is fascinating. Alexander is a monumental historical figure, but we focus more on the practical side of life than on the historical aspect. The road in Pyongyang is straight, but you don't know anything about it.", "headline": "Alexander is a monumental historical figure. But we focus more on the practical side of life than on the historical.", "gist": "Random indus valley tidbits.", "start": 1948094, "end": 2387510}, {"summary": "There are two aspects to the last episode of the series: the imaginary world and the physical world. For three listeners on Spotify that we have you, me and our managers. There are three aspects: the books, the furniture and the food and everything that is very physical to us.", "headline": "There are two aspects to the last episode of the series: the imaginary world and the physical world.", "gist": "The imaginary world and the physical world.", "start": 2388190, "end": 2536340}], "audio_url": "https://www.listennotes.com/e/p/972e2b8760e84459b95f775e59a852fa/", "thumbnail": "https://cdn-images-1.listennotes.com/podcasts/2-past-2-curious-history-podcast-biswa-BmujG3cv6NK-8KqzXNmlGZJ.300x300.jpg", "podcast_title": "2 past 2 curious | History podcast | Biswa Kalyan Rath and Kumar Varun", "episode_title": "2 Past 2 Curious Ep 6 Harappan Civilisation | Biswa Kalyan Rath And Kumar Varun"}